humidityRhoThermo/tutorials/laminar/settling/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inletTop 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inletBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outletTop
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outletBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
